vijaybaradwajr/alphagpio/Drivers/Inc/stm32f103c6xx.h
/*
 * stm32f103c6xx.h
 *
 *  Created on: Jun 22, 2025
 *      Author: vijay
 */
#include"stdint.h"
#ifndef STM32F103C6XX_H_
#define STM32F103C6XX_H_

#define ENABLE 1
#define DISABLE 0



#define AHB_BASE_ADDR 0x40018000U
#define APB1_BASE_ADDR 0x40000000U
#define APB2_BASE_ADDR 0x40010000U


//Peripheral Address
#define GPIOA_BASE_ADDR (APB2_BASE_ADDR+(0X0800))
#define GPIOB_BASE_ADDR (APB2_BASE_ADDR+(0X0C00))
#define GPIOC_BASE_ADDR (APB2_BASE_ADDR+(0X1000))
#define GPIOD_BASE_ADDR (APB2_BASE_ADDR+(0X1400))
#define GPIOE_BASE_ADDR (APB2_BASE_ADDR+(0X1800))
#define GPIOF_BASE_ADDR (APB2_BASE_ADDR+(0X1C00))
#define GPIOG_BASE_ADDR (APB2_BASE_ADDR+(0X2000))
#define RCC_BASE_ADDR 	(AHB_BASE_ADDR+(0X8000))

///struct def for creating a register to load all those gpio values

typedef struct
{
	uint32_t CRL;
	uint32_t CRH;
	uint32_t IDR;
	uint32_t ODR;
	uint32_t BSRR;
	uint32_t BRR;
	uint32_t LCKR;


}GPIO_RegDef_t;

//GPIO Type
typedef struct
{
	uint32_t port;
	uint32_t pin;
	uint32_t mode;
	uint32_t pinmode;
	uint32_t pull;
	uint32_t speed;
	uint32_t alt_func;

}GPIO_PinConfig_t;
///struct def for registers to hold RCC values


typedef struct
{
	uint32_t CR;
	uint32_t CFGR;
	uint32_t CIR;
	uint32_t APB2RSTR;
	uint32_t APB1RSTR;
	uint32_t AHBENR;
	uint32_t APB2ENR;
	uint32_t APB1ENR;
	uint32_t BDCR;
	uint32_t CSR;
	uint32_t AHBSTR;
	uint32_t CFGR2;
}RCC_RegDef_t;



//GPIO PIN NUMBERS AND POSITIONS




typedef struct{
	 uint32_t IMR;
	 uint32_t EMR;
	 uint32_t RTSR;
	 uint32_t FTSR;
	 uint32_t SWIER;
	 uint32_t PR;
}EXTI_RegDef_t;


typedef struct{
	 uint32_t EVCR;
	 uint32_t MAPR[3];
	 uint32_t EXTICR[4];
	 uint32_t MAPR2[2];
}AFIO_RegDef_t;


#define GPIO_PIN_NO_0      0
#define GPIO_PIN_NO_1      1
#define GPIO_PIN_NO_2      2
#define GPIO_PIN_NO_3      3
#define GPIO_PIN_NO_4      4
#define GPIO_PIN_NO_5      5
#define GPIO_PIN_NO_6      6
#define GPIO_PIN_NO_7      7
#define GPIO_PIN_NO_8      8
#define GPIO_PIN_NO_9      9
#define GPIO_PIN_NO_10     10
#define GPIO_PIN_NO_11     11
#define GPIO_PIN_NO_12     12
#define GPIO_PIN_NO_13     13
#define GPIO_PIN_NO_14     14
#define GPIO_PIN_NO_15     15

typedef enum{
 RISING_EDGE,
 FALLING_EDGE,
 RISING_FALLING_EDGE
}edge_select;
///points the registers to the addresses by using a pointer

#define GPIOA ((GPIO_RegDef_t*)GPIOA_BASE_ADDR)
#define GPIOB ((GPIO_RegDef_t*)GPIOB_BASE_ADDR)
#define GPIOC ((GPIO_RegDef_t*)GPIOC_BASE_ADDR)
#define GPIOD ((GPIO_RegDef_t*)GPIOD_BASE_ADDR)
#define GPIOE ((GPIO_RegDef_t*)GPIOE_BASE_ADDR)
//#define GPIOF (GPIO_RegDef_t*)GPIOF_BASE_ADDR
//#define GPIOG (GPIO_RegDef_t*)GPIOG_BASE_ADDR
#define RCC ((RCC_RegDef_t*)RCC_BASE_ADDR)



//points the registers to the addresses of RCC peripherals using a pointer
#define RCC_CR (RCC_RegDef_t*)(RCC_BASE_ADDR+(0x00))
#define RCC_CFGR (RCC_RegDef_t*)(RCC_BASE_ADDR+(0x04))
#define RCC_CIR (RCC_RegDef_t*)(RCC_BASE_ADDR+(0x08))
#define RCC_APB2RSTR (RCC_RegDef_t*)(RCC_BASE_ADDR+(0x0C))
#define RCC_APB1RSTR (RCC_RegDef_t*)(RCC_BASE_ADDR+(0x10))
#define RCC_AHBENR (RCC_RegDef_t*)(RCC_BASE_ADDR+(0x14))
#define RCC_APB2ENR (RCC_RegDef_t*)(RCC_BASE_ADDR+(0x18))
#define RCC_APB1ENR (RCC_RegDef_t*)(RCC_BASE_ADDR+(0x1C))
#define RCC_BDCR (RCC_RegDef_t*)(RCC_BASE_ADDR+(0x20))
#define RCC_CSR (RCC_RegDef_t*)(RCC_BASE_ADDR+(0x24))
#define RCC_AHBSTR (RCC_RegDef_t*)(RCC_BASE_ADDR+(0x28))
#define RCC_CFGR2 (RCC_RegDef_t*)(RCC_BASE_ADDR+(0x2C))


//enable clocks for the same

#define GPIOA_Clk_En() (RCC->APB2ENR|=(1<<2))
#define GPIOB_Clk_En() (RCC->APB2ENR|=(1<<3))
#define GPIOC_Clk_En() (RCC->APB2ENR|=(1<<4))
#define GPIOD_Clk_En() (RCC->APB2ENR|=(1<<5))
#define GPIOE_Clk_En() (RCC->APB2ENR|=(1<<6))

#define GPIOA_Clk_Di() (RCC->APB2ENR&=~(1<<2))
#define GPIOB_Clk_Di() (RCC->APB2ENR&=~(1<<3))
#define GPIOC_Clk_Di() (RCC->APB2ENR&=~(1<<4))
#define GPIOD_Clk_Di() (RCC->APB2ENR&=~(1<<5))
#define GPIOE_Clk_Di() (RCC->APB2ENR&=~(1<<6))


/*GPIO PIN Modes
 * */
#define OUTPUT_MODE ((uint32_t)0x01)
#define INPUT_MODE  ((uint32_t)0x02)

//pin mode
#define GPIO_MODE_INPUT ((uint32_t)0x00)
#define GPIO_MODE_OUTPUT_10MHZ ((uint32_t)0x01)
#define GPIO_MODE_OUTPUT_2MHZ ((uint32_t)0x02)
#define GPIO_MODE_OUTPUT_50MHZ ((uint32_t)0x03)

//if input
#define GPIO_ANALOGMODE ((uint32_t)0x00)
#define GPIO_FLOATINGIN ((uint32_t)0x01)
#define GPIO_INPUPD ((uint32_t)0x02)
#define GPIO_RESERVED ((uint32_t)0x03)

//if output
#define GPIO_PUPD ((uint32_t)0x00)
#define GPIO_OPD ((uint32_t)0x01)
#define GPIO_AFPUPD ((uint32_t)0x02)
#define GPIO_AFUOPD ((uint32_t)0x03)

//pinpos
extern uint32_t PINPOS[16];
// some generic macros

#define SET             ENABLE
#define RESET           DISABLE
#define GPIO_PIN_SET    SET
#define GPIO_PIN_RESET  RESET
#define FLAG_SET        1
#define FLAG_RESET      0

//interrupts
typedef enum
{
/******  Cortex-M3 Processor Exceptions Numbers ***************************************************/
 NonMaskableInt_IRQn         = -14,    /*!< 2 Non Maskable Interrupt                             */
 HardFault_IRQn              = -13,    /*!< 3 Cortex-M3 Hard Fault Interrupt                     */
 MemoryManagement_IRQn       = -12,    /*!< 4 Cortex-M3 Memory Management Interrupt              */
 BusFault_IRQn               = -11,    /*!< 5 Cortex-M3 Bus Fault Interrupt                      */
 UsageFault_IRQn             = -10,    /*!< 6 Cortex-M3 Usage Fault Interrupt                    */
 SVCall_IRQn                 = -5,     /*!< 11 Cortex-M3 SV Call Interrupt                       */
 DebugMonitor_IRQn           = -4,     /*!< 12 Cortex-M3 Debug Monitor Interrupt                 */
 PendSV_IRQn                 = -2,     /*!< 14 Cortex-M3 Pend SV Interrupt                       */
 SysTick_IRQn                = -1,     /*!< 15 Cortex-M3 System Tick Interrupt                   */

/******  STM32 specific Interrupt Numbers *********************************************************/
 WWDG_IRQn                   = 0,      /*!< Window WatchDog Interrupt                            */
 PVD_IRQn                    = 1,      /*!< PVD through EXTI Line detection Interrupt            */
 TAMPER_IRQn                 = 2,      /*!< Tamper Interrupt                                     */
 RTC_IRQn                    = 3,      /*!< RTC global Interrupt                                 */
 FLASH_IRQn                  = 4,      /*!< FLASH global Interrupt                               */
 RCC_IRQn                    = 5,      /*!< RCC global Interrupt                                 */
 EXTI0_IRQn                  = 6,      /*!< EXTI Line0 Interrupt                                 */
 EXTI1_IRQn                  = 7,      /*!< EXTI Line1 Interrupt                                 */
 EXTI2_IRQn                  = 8,      /*!< EXTI Line2 Interrupt                                 */
 EXTI3_IRQn                  = 9,      /*!< EXTI Line3 Interrupt                                 */
 EXTI4_IRQn                  = 10,     /*!< EXTI Line4 Interrupt                                 */
 DMA1_Channel1_IRQn          = 11,     /*!< DMA1 Channel 1 global Interrupt                      */
 DMA1_Channel2_IRQn          = 12,     /*!< DMA1 Channel 2 global Interrupt                      */
 DMA1_Channel3_IRQn          = 13,     /*!< DMA1 Channel 3 global Interrupt                      */
 DMA1_Channel4_IRQn          = 14,     /*!< DMA1 Channel 4 global Interrupt                      */
 DMA1_Channel5_IRQn          = 15,     /*!< DMA1 Channel 5 global Interrupt                      */
 DMA1_Channel6_IRQn          = 16,     /*!< DMA1 Channel 6 global Interrupt                      */
 DMA1_Channel7_IRQn          = 17,     /*!< DMA1 Channel 7 global Interrupt                      */
 ADC1_2_IRQn                 = 18,     /*!< ADC1 and ADC2 global Interrupt                       */
 USB_HP_CAN1_TX_IRQn         = 19,     /*!< USB Device High Priority or CAN1 TX Interrupts       */
 USB_LP_CAN1_RX0_IRQn        = 20,     /*!< USB Device Low Priority or CAN1 RX0 Interrupts       */
 CAN1_RX1_IRQn               = 21,     /*!< CAN1 RX1 Interrupt                                   */
 CAN1_SCE_IRQn               = 22,     /*!< CAN1 SCE Interrupt                                   */
 EXTI9_5_IRQn                = 23,     /*!< External Line[9:5] Interrupts                        */
 TIM1_BRK_IRQn               = 24,     /*!< TIM1 Break Interrupt                                 */
 TIM1_UP_IRQn                = 25,     /*!< TIM1 Update Interrupt                                */
 TIM1_TRG_COM_IRQn           = 26,     /*!< TIM1 Trigger and Commutation Interrupt               */
 TIM1_CC_IRQn                = 27,     /*!< TIM1 Capture Compare Interrupt                       */
 TIM2_IRQn                   = 28,     /*!< TIM2 global Interrupt                                */
 TIM3_IRQn                   = 29,     /*!< TIM3 global Interrupt                                */
 I2C1_EV_IRQn                = 31,     /*!< I2C1 Event Interrupt                                 */
 I2C1_ER_IRQn                = 32,     /*!< I2C1 Error Interrupt                                 */
 SPI1_IRQn                   = 35,     /*!< SPI1 global Interrupt                                */
 USART1_IRQn                 = 37,     /*!< USART1 global Interrupt                              */
 USART2_IRQn                 = 38,     /*!< USART2 global Interrupt                              */
 EXTI15_10_IRQn              = 40,     /*!< External Line[15:10] Interrupts                      */
 RTC_Alarm_IRQn              = 41,     /*!< RTC Alarm through EXTI Line Interrupt                */
 USBWakeUp_IRQn              = 42,     /*!< USB Device WakeUp from suspend through EXTI Line Interrupt */
} IRQn_Type;


/***************************************  START: Processor Specific Details *********************************************/
/*
 *  ARM Cortex Mx Processor NVIC ISERx register Addresses
 */

#define NVIC_ISER0				(( uint32_t *)0xE000E100)
#define NVIC_ISER1				((uint32_t *)0xE000E104)
#define NVIC_ISER2				(( uint32_t *)0xE000E108)
#define NVIC_ISER3				(( uint32_t *)0xE000E10C)

