vijaybaradwajr/alphagpio/Drivers/Inc/stm32f103c6xx.h
/*
 *  ARM Cortex Mx Processor NVIC ICERx register Addresses
 */

#define NVIC_ICER0				(( uint32_t *)0XE000E180)
#define NVIC_ICER1				(( uint32_t *)0XE000E184)
#define NVIC_ICER2				(( uint32_t *)0XE000E188)
#define NVIC_ICER3				(( uint32_t *)0XE000E18C)


/*
 *  ARM Cortex Mx Processor NVIC Priority Register Addresses Calculation
 */

#define NVIC_PR_BASE_ADDR			(( uint32_t *) 0xE000E400)


#define NO_PR_BITS_IMPLEMENTED				4



/*
 * Base addresses of Flash and SRAM memories
 */

#define FLASH_BASEADDR 					0x08000000U // flash memory base address
#define SRAM1_BASEADDR 					0x20000000U // SRAM base address, for stm32f1 there is only one SRM
#define ROM_BASEADDR 					0x1FFFF000U // ROM base address
#define SRAM 							SRAM1_BASEADDR

/*
 * AHBx and APBx Bus Peripheral base address
 */

#define PERIPH_BASEADDR 				0x40000000U
#define APB1PERIPH_BASEADDR             PERIPH_BASEADDR
#define APB2PERIPH_BASEADDR				0x40010000U
#define AHBPERIPH_BASEADDR 				0x40018000U

/*
 * Base addresses of peripherals which are hanging on APB2 bus
 */

#define EXTI_BASEADDR   				(APB2PERIPH_BASEADDR + 0x0400)
#define AFIO_BASEADDR					(APB2PERIPH_BASEADDR)

#define GPIOA_BASEADDR  				(APB2PERIPH_BASEADDR + 0x0800)
#define GPIOB_BASEADDR  				(APB2PERIPH_BASEADDR + 0x0C00)
#define GPIOC_BASEADDR  				(APB2PERIPH_BASEADDR + 0x1000)
#define GPIOD_BASEADDR  				(APB2PERIPH_BASEADDR + 0x1400)
#define GPIOE_BASEADDR  				(APB2PERIPH_BASEADDR + 0x1800)
#define GPIOF_BASEADDR  				(APB2PERIPH_BASEADDR + 0x1C00)
#define GPIOG_BASEADDR  				(APB2PERIPH_BASEADDR + 0x2000)

#define SPI1_BASEADDR   				(APB2PERIPH_BASEADDR + 0x3000)
#define USART1_BASEADDR 				(APB2PERIPH_BASEADDR + 0x3800)

/*
 * Base addresses of peripherals which are hanging on APB1 bus
 */

#define SPI2_BASEADDR 					(APB1PERIPH_BASEADDR + 0x3800)
#define SPI3_BASEADDR 					(APB1PERIPH_BASEADDR + 0x3C00)

#define USART2_BASEADDR 				(APB1PERIPH_BASEADDR + 0x4400)
#define USART3_BASEADDR 				(APB1PERIPH_BASEADDR + 0x4800)
#define UART4_BASEADDR 					(APB1PERIPH_BASEADDR + 0x4C00)
#define UART5_BASEADDR 					(APB1PERIPH_BASEADDR + 0x5000)

#define I2C1_BASEADDR 					(APB1PERIPH_BASEADDR + 0x5400)
#define I2C2_BASEADDR 					(APB1PERIPH_BASEADDR + 0x5800)

#define bxCAN2_BASEADDR 				(APB1PERIPH_BASEADDR + 0x6800)
#define bxCAN1_BASEADDR 				(APB1PERIPH_BASEADDR + 0x6400)




/*
 * Base addresses of peripherals which are hanging on AHB bus
 */

#define RCC_BASEADDR 					(AHBPERIPH_BASEADDR + 0x9000)



//#define EXTI0_IRQn 						6
//#define EXTI1_IRQn 						7
//#define EXTI2_IRQn 						8
//#define EXTI3_IRQn 						9
//#define EXTI4_IRQn 						10
//#define EXTI9_5_IRQn 					23
//#define EXTI15_10_IRQn 					40


/************************* Bit definition for AFIO_EXTICR1 register ***********************************/

#define AFIO_EXTICR1_EXTI0				((uint16_t) 0x000F);			/*!< EXTI 0 Configuration  */
#define AFIO_EXTICR1_EXTI1				((uint16_t) 0x00F0);			/*!< EXTI 1 Configuration  */
#define AFIO_EXTICR1_EXTI2				((uint16_t) 0x0F00);			/*!< EXTI 2 Configuration  */
#define AFIO_EXTICR1_EXTI3				((uint16_t) 0xF000);			/*!< EXTI 3 Configuration  */

/*!< EXTI0 Configuration  */
#define AFIO_EXTICR1_EXTI0_PA			((uint16_t) 0x0000);			/*!< PA[0] pin  */
#define AFIO_EXTICR1_EXTI0_PB			((uint16_t) 0x0001);			/*!< PB[0] pin  */
#define AFIO_EXTICR1_EXTI0_PC			((uint16_t) 0x0002);			/*!< PC[0] pin  */
#define AFIO_EXTICR1_EXTI0_PD			((uint16_t) 0x0003);			/*!< PD[0] pin  */
#define AFIO_EXTICR1_EXTI0_PE			((uint16_t) 0x0004);			/*!< PE[0] pin  */
#define AFIO_EXTICR1_EXTI0_PF			((uint16_t) 0x0005);			/*!< PF[0] pin  */
#define AFIO_EXTICR1_EXTI0_PG			((uint16_t) 0x0006);			/*!< PG[0] pin  */


/*!< EXTI1 Configuration  */
#define AFIO_EXTICR1_EXTI1_PA			((uint16_t) 0x0000);			/*!< PA[1] pin  */
#define AFIO_EXTICR1_EXTI1_PB			((uint16_t) 0x0010);			/*!< PB[1] pin  */
#define AFIO_EXTICR1_EXTI1_PC			((uint16_t) 0x0020);			/*!< PC[1] pin  */
#define AFIO_EXTICR1_EXTI1_PD			((uint16_t) 0x0030);			/*!< PD[1] pin  */
#define AFIO_EXTICR1_EXTI1_PE			((uint16_t) 0x0040);			/*!< PE[1] pin  */
#define AFIO_EXTICR1_EXTI1_PF			((uint16_t) 0x0050);			/*!< PF[1] pin  */
#define AFIO_EXTICR1_EXTI1_PG			((uint16_t) 0x0060);			/*!< PG[1] pin  */


/*!< EXTI2 Configuration  */
#define AFIO_EXTICR1_EXTI2_PA			((uint16_t) 0x0000);			/*!< PA[2] pin  */
#define AFIO_EXTICR1_EXTI2_PB			((uint16_t) 0x0100);			/*!< PB[2] pin  */
#define AFIO_EXTICR1_EXTI2_PC			((uint16_t) 0x0200);			/*!< PC[2] pin  */
#define AFIO_EXTICR1_EXTI2_PD			((uint16_t) 0x0300);			/*!< PD[2] pin  */
#define AFIO_EXTICR1_EXTI2_PE			((uint16_t) 0x0400);			/*!< PE[2] pin  */
#define AFIO_EXTICR1_EXTI2_PF			((uint16_t) 0x0500);			/*!< PF[2] pin  */
#define AFIO_EXTICR1_EXTI2_PG			((uint16_t) 0x0600);			/*!< PG[2] pin  */


/*!< EXTI3 Configuration  */
#define AFIO_EXTICR1_EXTI3_PA			((uint16_t) 0x0000);			/*!< PA[3] pin  */
#define AFIO_EXTICR1_EXTI3_PB			((uint16_t) 0x1000);			/*!< PB[3] pin  */
#define AFIO_EXTICR1_EXTI3_PC			((uint16_t) 0x2000);			/*!< PC[3] pin  */
#define AFIO_EXTICR1_EXTI3_PD			((uint16_t) 0x3000);			/*!< PD[3] pin  */
#define AFIO_EXTICR1_EXTI3_PE			((uint16_t) 0x4000);			/*!< PE[3] pin  */
#define AFIO_EXTICR1_EXTI3_PF			((uint16_t) 0x5000);			/*!< PF[3] pin  */
#define AFIO_EXTICR1_EXTI3_PG			((uint16_t) 0x6000);			/*!< PG[3] pin  */




/************************* Bit definition for AFIO_EXTICR2 register ***********************************/
#define AFIO_EXTICR2_EXTI4				((uint16_t) 0x000F);			/*!< EXTI 4 Configuration  */
#define AFIO_EXTICR2_EXTI5				((uint16_t) 0x00F0);			/*!< EXTI 5 Configuration  */
#define AFIO_EXTICR2_EXTI6				((uint16_t) 0x0F00);			/*!< EXTI 6 Configuration  */
#define AFIO_EXTICR2_EXTI7				((uint16_t) 0xF000);			/*!< EXTI 7 Configuration  */

/*!< EXTI4 Configuration  */
#define AFIO_EXTICR2_EXTI4_PA			((uint16_t) 0x0000);			/*!< PA[4] pin  */
#define AFIO_EXTICR2_EXTI4_PB			((uint16_t) 0x0001);			/*!< PB[4] pin  */
#define AFIO_EXTICR2_EXTI4_PC			((uint16_t) 0x0002);			/*!< PC[4] pin  */
#define AFIO_EXTICR2_EXTI4_PD			((uint16_t) 0x0003);			/*!< PD[4] pin  */
#define AFIO_EXTICR2_EXTI4_PE			((uint16_t) 0x0004);			/*!< PE[4] pin  */
#define AFIO_EXTICR2_EXTI4_PF			((uint16_t) 0x0005);			/*!< PF[4] pin  */
#define AFIO_EXTICR2_EXTI4_PG			((uint16_t) 0x0006);			/*!< PG[4] pin  */


/*!< EXTI1 Configuration  */
#define AFIO_EXTICR2_EXTI5_PA			((uint16_t) 0x0000);			/*!< PA[5] pin  */
#define AFIO_EXTICR2_EXTI5_PB			((uint16_t) 0x0010);			/*!< PB[5] pin  */
#define AFIO_EXTICR2_EXTI5_PC			((uint16_t) 0x0020);			/*!< PC[5] pin  */
#define AFIO_EXTICR2_EXTI5_PD			((uint16_t) 0x0030);			/*!< PD[5] pin  */
#define AFIO_EXTICR2_EXTI5_PE			((uint16_t) 0x0040);			/*!< PE[5] pin  */
#define AFIO_EXTICR2_EXTI5_PF			((uint16_t) 0x0050);			/*!< PF[5] pin  */
#define AFIO_EXTICR2_EXTI5_PG			((uint16_t) 0x0060);			/*!< PG[5] pin  */


/*!< EXTI2 Configuration  */
#define AFIO_EXTICR2_EXTI6_PA			((uint16_t) 0x0000);			/*!< PA[6] pin  */
#define AFIO_EXTICR2_EXTI6_PB			((uint16_t) 0x0100);			/*!< PB[6] pin  */
#define AFIO_EXTICR2_EXTI6_PC			((uint16_t) 0x0200);			/*!< PC[6] pin  */
#define AFIO_EXTICR2_EXTI6_PD			((uint16_t) 0x0300);			/*!< PD[6] pin  */
#define AFIO_EXTICR2_EXTI6_PE			((uint16_t) 0x0400);			/*!< PE[6] pin  */
#define AFIO_EXTICR2_EXTI6_PF			((uint16_t) 0x0500);			/*!< PF[6] pin  */
#define AFIO_EXTICR2_EXTI6_PG			((uint16_t) 0x0600);			/*!< PG[6] pin  */


/*!< EXTI3 Configuration  */
#define AFIO_EXTICR2_EXTI7_PA			((uint16_t) 0x0000);			/*!< PA[6] pin  */
#define AFIO_EXTICR2_EXTI7_PB			((uint16_t) 0x1000);			/*!< PB[6] pin  */
#define AFIO_EXTICR2_EXTI7_PC			((uint16_t) 0x2000);			/*!< PC[6] pin  */
#define AFIO_EXTICR2_EXTI7_PD			((uint16_t) 0x3000);			/*!< PD[6] pin  */
#define AFIO_EXTICR2_EXTI7_PE			((uint16_t) 0x4000);			/*!< PE[6] pin  */
#define AFIO_EXTICR2_EXTI7_PF			((uint16_t) 0x5000);			/*!< PF[6] pin  */
#define AFIO_EXTICR2_EXTI7_PG			((uint16_t) 0x6000);			/*!< PG[6] pin  */


