vijaybaradwajr/alphagpio/Drivers/Inc/stm32f103c6xx.h
/************************* Bit definition for AFIO_EXTICR3 register ***********************************/

#define AFIO_EXTICR3_EXTI8				((uint16_t) 0x000F);			/*!< EXTI 8 Configuration  */
#define AFIO_EXTICR3_EXTI9				((uint16_t) 0x00F0);			/*!< EXTI 9 Configuration  */
#define AFIO_EXTICR3_EXTI10				((uint16_t) 0x0F00);			/*!< EXTI 10 Configuration  */
#define AFIO_EXTICR4_EXTI11				((uint16_t) 0xF000);			/*!< EXTI 11 Configuration  */

/*!< EXTI4 Configuration  */
#define AFIO_EXTICR3_EXTI8_PA			((uint16_t) 0x0000);			/*!< PA[8] pin  */
#define AFIO_EXTICR3_EXTI8_PB			((uint16_t) 0x0001);			/*!< PB[8] pin  */
#define AFIO_EXTICR3_EXTI8_PC			((uint16_t) 0x0002);			/*!< PC[8] pin  */
#define AFIO_EXTICR3_EXTI8_PD			((uint16_t) 0x0003);			/*!< PD[8] pin  */
#define AFIO_EXTICR3_EXTI8_PE			((uint16_t) 0x0004);			/*!< PE[8] pin  */
#define AFIO_EXTICR3_EXTI8_PF			((uint16_t) 0x0005);			/*!< PF[8] pin  */
#define AFIO_EXTICR3_EXTI8_PG			((uint16_t) 0x0006);			/*!< PG[8] pin  */


/*!< EXTI1 Configuration  */
#define AFIO_EXTICR3_EXTI9_PA			((uint16_t) 0x0000);			/*!< PA[9] pin  */
#define AFIO_EXTICR3_EXTI9_PB			((uint16_t) 0x0010);			/*!< PB[9] pin  */
#define AFIO_EXTICR3_EXTI9_PC			((uint16_t) 0x0020);			/*!< PC[9] pin  */
#define AFIO_EXTICR3_EXTI9_PD			((uint16_t) 0x0030);			/*!< PD[9] pin  */
#define AFIO_EXTICR3_EXTI9_PE			((uint16_t) 0x0040);			/*!< PE[9] pin  */
#define AFIO_EXTICR3_EXTI9_PF			((uint16_t) 0x0050);			/*!< PF[9] pin  */
#define AFIO_EXTICR3_EXTI9_PG			((uint16_t) 0x0060);			/*!< PG[9] pin  */


/*!< EXTI2 Configuration  */
#define AFIO_EXTICR3_EXTI10_PA			((uint16_t) 0x0000);			/*!< PA[10] pin  */
#define AFIO_EXTICR3_EXTI10_PB			((uint16_t) 0x0100);			/*!< PB[10] pin  */
#define AFIO_EXTICR3_EXTI10_PC			((uint16_t) 0x0200);			/*!< PC[10] pin  */
#define AFIO_EXTICR3_EXTI10_PD			((uint16_t) 0x0300);			/*!< PD[10] pin  */
#define AFIO_EXTICR3_EXTI10_PE			((uint16_t) 0x0400);			/*!< PE[10] pin  */
#define AFIO_EXTICR3_EXTI10_PF			((uint16_t) 0x0500);			/*!< PF[10] pin  */
#define AFIO_EXTICR3_EXTI10_PG			((uint16_t) 0x0600);			/*!< PG[10] pin  */

/*!< EXTI3 Configuration  */
#define AFIO_EXTICR3_EXTI11_PA			((uint16_t) 0x0000);			/*!< PA[11] pin  */
#define AFIO_EXTICR3_EXTI11_PB			((uint16_t) 0x1000);			/*!< PB[11] pin  */
#define AFIO_EXTICR3_EXTI11_PC			((uint16_t) 0x2000);			/*!< PC[11] pin  */
#define AFIO_EXTICR3_EXTI11_PD			((uint16_t) 0x3000);			/*!< PD[11] pin  */
#define AFIO_EXTICR3_EXTI11_PE			((uint16_t) 0x4000);			/*!< PE[11] pin  */
#define AFIO_EXTICR3_EXTI11_PF			((uint16_t) 0x5000);			/*!< PF[11] pin  */
#define AFIO_EXTICR3_EXTI11_PG			((uint16_t) 0x6000);			/*!< PG[11] pin  */



/************************* Bit definition for AFIO_EXTICR4 register ***********************************/

#define AFIO_EXTICR4_EXTI12				((uint16_t) 0x000F);			/*!< EXTI 12 Configuration  */
#define AFIO_EXTICR4_EXTI13				((uint16_t) 0x00F0);			/*!< EXTI 13 Configuration  */
#define AFIO_EXTICR4_EXTI14				((uint16_t) 0x0F00);			/*!< EXTI 14 Configuration  */
#define AFIO_EXTICR4_EXTI15				((uint16_t) 0xF000);			/*!< EXTI 15 Configuration  */

/*!< EXTI4 Configuration  */
#define AFIO_EXTICR4_EXTI12_PA			((uint16_t) 0x0000);			/*!< PA[12] pin  */
#define AFIO_EXTICR4_EXTI12_PB			((uint16_t) 0x0001);			/*!< PB[12] pin  */
#define AFIO_EXTICR4_EXTI12_PC			((uint16_t) 0x0002);			/*!< PC[12] pin  */
#define AFIO_EXTICR4_EXTI12_PD			((uint16_t) 0x0003);			/*!< PD[12] pin  */
#define AFIO_EXTICR4_EXTI12_PE			((uint16_t) 0x0004);			/*!< PE[12] pin  */
#define AFIO_EXTICR4_EXTI12_PF			((uint16_t) 0x0005);			/*!< PF[12] pin  */
#define AFIO_EXTICR4_EXTI12_PG			((uint16_t) 0x0006);			/*!< PG[12] pin  */


/*!< EXTI1 Configuration  */
#define AFIO_EXTICR4_EXTI13_PA			((uint16_t) 0x0000);			/*!< PA[13] pin  */
#define AFIO_EXTICR4_EXTI13_PB			((uint16_t) 0x0010);			/*!< PB[13] pin  */
#define AFIO_EXTICR4_EXTI13_PC			((uint16_t) 0x0020);			/*!< PC[13] pin  */
#define AFIO_EXTICR4_EXTI13_PD			((uint16_t) 0x0030);			/*!< PD[13] pin  */
#define AFIO_EXTICR4_EXTI13_PE			((uint16_t) 0x0040);			/*!< PE[13] pin  */
#define AFIO_EXTICR4_EXTI13_PF			((uint16_t) 0x0050);			/*!< PF[13] pin  */
#define AFIO_EXTICR4_EXTI13_PG			((uint16_t) 0x0060);			/*!< PG[13] pin  */

/*!< EXTI2 Configuration  */
#define AFIO_EXTICR4_EXTI14_PA			((uint16_t) 0x0000);			/*!< PA[14] pin  */
#define AFIO_EXTICR4_EXTI14_PB			((uint16_t) 0x0100);			/*!< PB[14] pin  */
#define AFIO_EXTICR4_EXTI14_PC			((uint16_t) 0x0200);			/*!< PC[14] pin  */
#define AFIO_EXTICR4_EXTI14_PD			((uint16_t) 0x0300);			/*!< PD[14] pin  */
#define AFIO_EXTICR4_EXTI14_PE			((uint16_t) 0x0400);			/*!< PE[14] pin  */
#define AFIO_EXTICR4_EXTI14_PF			((uint16_t) 0x0500);			/*!< PF[14] pin  */
#define AFIO_EXTICR4_EXTI14_PG			((uint16_t) 0x0600);			/*!< PG[14] pin  */

/*!< EXTI3 Configuration  */
#define AFIO_EXTICR4_EXTI15_PA			((uint16_t) 0x0000);			/*!< PA[15] pin  */
#define AFIO_EXTICR4_EXTI15_PB			((uint16_t) 0x1000);			/*!< PB[15] pin  */
#define AFIO_EXTICR4_EXTI15_PC			((uint16_t) 0x2000);			/*!< PC[15] pin  */
#define AFIO_EXTICR4_EXTI15_PD			((uint16_t) 0x3000);			/*!< PD[15] pin  */
#define AFIO_EXTICR4_EXTI15_PE			((uint16_t) 0x4000);			/*!< PE[15] pin  */
#define AFIO_EXTICR4_EXTI15_PF			((uint16_t) 0x5000);			/*!< PF[15] pin  */
#define AFIO_EXTICR4_EXTI15_PG			((uint16_t) 0x6000);			/*!< PG[15] pin  */


/********************************************************************************************
* Bit position definitions of I2C peripherals
*********************************************************************************************/
/*
 * Bit position definitions I2C_CR1
 */
#define I2C_CR1_PE						0
#define I2C_CR1_NOSTRETCH				7
#define I2C_CR1_START					8
#define I2C_CR1_STOP					9
#define I2C_CR1_ACK						10
#define I2C_CR1_SWRST					15

/*
 * Bit position definitions I2C_CR2
 */
#define I2C_CR2_FREQ					0
#define I2C_CR2_ITERREN					8
#define I2C_CR2_ITEVTEN					9
#define I2C_CR2_ITBUFEN					10
#define I2C_CR2_DMAEN					11
#define I2C_CR2_LAST					12

/*
 * Bit position definitions I2C_OAR1
 */
#define I2C_OAR1_ADD0					0
#define I2C_OAR1_ADD71					1
#define I2C_OAR1_ADD98					8
#define I2C_OAR1_ADDMODE				15

/*
 * Bit position definitions I2C_SR1
 */
#define I2C_SR1_SB						0
#define I2C_SR1_ADDR					1
#define I2C_SR1_BTF						2
#define I2C_SR1_ADD10					3
#define I2C_SR1_STOPF					4
#define I2C_SR1_RxNE					6
#define I2C_SR1_TxE						7
#define I2C_SR1_BERR					8
#define I2C_SR1_ARLO					9
#define I2C_SR1_AF						10
#define I2C_SR1_OVR						11
#define I2C_SR1_PECERR					12
#define I2C_SR1_TIMEOUT					14
#define I2C_SR1_SMBALERT				15

/*
 * Bit position definitions I2C_SR2
 */
#define I2C_SR2_MSL						0
#define I2C_SR2_BUSY					1
#define I2C_SR2_TRA						2
#define I2C_SR2_GENCALL					4
#define I2C_SR2_SMBDEFAULT				5
#define I2C_SR2_SMBHOST					6
#define I2C_SR2_DUALF					7
#define I2C_SR2_PEC						8

/*
 * Bit position definitions I2C_CCR
 */
#define I2C_SR2_CCR						0
#define I2C_SR2_DUTY					14
#define I2C_SR2_FS						15

//interrupts
#define EXTI 							((EXTI_RegDef_t*) EXTI_BASEADDR)
#define AFIO							((AFIO_RegDef_t*) AFIO_BASEADDR)
#endif /* STM32F103C6XX_H_ */
